# Answer 1

In [1]:
a = 0

def b():
    global a
    a = c(a)

def c(a):
    return a + 2

b()
b()
b()
a

6

In [ ]:
1. a = 0: Initializes the variable 'a' to 0.
2. def b(): Defines a function b() that updates the global variable 'a' by calling the function 'c(a)'.
3. def c(a): Defines a function c(a) that adds 2 to its argument 'a' and returns the result.
4. b(): First call to function b() updates 'a' to 2 by calling c(a) (0 + 2).
5. b(): Second call to function b() updates 'a' to 4 by calling c(a) (2 + 2).
6. b(): Third call to function b() updates 'a' to 6 by calling c(a) (4 + 2).
7. a: When evaluating 'a', it displays the final value of 'a', which is 6.

So, the final value of 'a' is 6.

# Answer 2

In [27]:
def file_length(file_name):
    try:
        file = open(file_name)
        contents = file.read()
        file.close()
        print(len(contents))
    except FileNotFoundError:
        print("File "+file_name+" not found")

file_name = "midterm.py"
file_length(file_name)

file_name = "idterm.py"
file_length(file_name)

205
File idterm.py not found

# Answer 3

In [4]:
class Marsupial:
    def __init__(self):
        self.pouch = []

    def put_in_pouch(self, item):
        self.pouch.append(item)

    def pouch_contents(self):
        return self.pouch

class Kangaroo(Marsupial):
    def __init__(self, x, y):
        super().__init__()
        self.x = x
        self.y = y

    def jump(self, dx, dy):
        self.x += dx
        self.y += dy

    def __str__(self):
        return f"I am a Kangaroo located at coordinates ({self.x},{self.y})"

m = Marsupial()
m.put_in_pouch('doll')
m.put_in_pouch('firetruck')
m.put_in_pouch('kitten')
print(m.pouch_contents())

k = Kangaroo(0, 0)
print(k)

k.put_in_pouch('doll')
k.put_in_pouch('firetruck')
k.put_in_pouch('kitten')
print(k.pouch_contents())

k.jump(1, 0)
k.jump(1, 0)
k.jump(1, 0)
print(k)

['doll', 'firetruck', 'kitten']
I am a Kangaroo located at coordinates (0,0)
['doll', 'firetruck', 'kitten']
I am a Kangaroo located at coordinates (3,0)

# Answer 4

In [5]:
def collatz(x):
    print(x)

    if x == 1:
        return

    if x % 2 == 0:
        collatz(x // 2)  # If x is even
    else:
        collatz(3 * x + 1)  # If x is odd

collatz(1)
collatz(10)

1
10
5
16
8
4
2
1

# Answer 5

In [6]:
def binary(n):
    if n == 0:
        print("0")
    elif n == 1:
        print("1")
    else:
        binary(n // 2)
        print(n % 2, end="")

binary(0)
binary(1)
binary(3)
binary(9)

0
1
1
11
001

# Answer 6

In [7]:
from html.parser import HTMLParser

class HeadingParser(HTMLParser):
    def __init__(self):
        super().__init__()
        self.in_heading = False
        self.current_heading_level = 0

    def handle_starttag(self, tag, attrs):
        if tag.startswith("h") and tag[1:].isdigit():
            self.in_heading = True
            self.current_heading_level = int(tag[1]) - 1

    def handle_data(self, data):
        if self.in_heading:
            indentation = "  " * self.current_heading_level
            print(f"{indentation}{data}")

    def handle_endtag(self, tag):
        if tag.startswith("h") and tag[1:].isdigit():
            self.in_heading = False

infile = open('w3c.html')
content = infile.read()
infile.close()

hp = HeadingParser()
hp.feed(content)

W3C Mission
  Principles

# Answer 7

In [ ]:
import urllib.request

def fetch_urls(url):
        response = urllib.request.urlopen(url)
        html = response.read().decode('utf-8')
        urls = []
        start = 0
        while True:
            start = html.find('<a href="http', start)
            if start == -1:
                break
            end = html.find('"', start + 9)
            urls.append(html[start + 9:end])
            start = end
        return urls

def webdir(url, depth, indent=0):
    if depth < 0:
        return

    print('  ' * indent + url)

    if depth == 0:
        return

    links = fetch_urls(url)

    for link in links:
        webdir(link, depth - 1, indent + 1)
        
webdir('https://en.wikipedia.org/wiki/Elon_Musk', 2, 0)

# Answer 8

In [2]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [4]:
%sql sqlite:///mydatabase.db

In [5]:
%%sql
CREATE TABLE Temp_table (
    City TEXT,
    Country TEXT,
    Season TEXT,
    Temperature_C INT,
    Rainfall_mm INT
);

 * sqlite:///mydatabase.db
Done.

[]

In [6]:
%%sql
INSERT INTO Temp_table (City, Country, Season, Temperature_C, Rainfall_mm)
VALUES
    ("Mumbai", "India", "Winter", 24.8, 5.9),
    ("Mumbai", "India", "Spring", 28.4, 16.2),
    ("Mumbai", "India", "Summer", 27.9, 1549.4),
    ("Mumbai", "India", "Fall", 27.6, 346.0),
    ("London", "United Kingdom", "Winter", 4.2, 207.7),
    ("London", "United Kingdom", "Spring", 8.3, 169.6),
    ("London", "United Kingdom", "Summer", 15.7, 157.0),
    ("London", "United Kingdom", "Fall", 10.4, 218.5),
    ("Cairo", "Egypt", "Winter", 13.6, 16.5),
    ("Cairo", "Egypt", "Spring", 20.7, 6.5),
    ("Cairo", "Egypt", "Summer", 27.7, 0.1),
    ("Cairo", "Egypt", "Fall", 22.2, 4.5);

 * sqlite:///mydatabase.db
12 rows affected.

[]

# Answer 8(a)

In [10]:
%sql SELECT Temperature_C FROM Temp_table;

 * sqlite:///mydatabase.db
Done.

[(24.8,),
 (28.4,),
 (27.9,),
 (27.6,),
 (4.2,),
 (8.3,),
 (15.7,),
 (10.4,),
 (13.6,),
 (20.7,),
 (27.7,),
 (22.2,)]

# Answer 8(b)

In [11]:
%sql SELECT DISTINCT(City) FROM Temp_table;

 * sqlite:///mydatabase.db
Done.

[('Mumbai',), ('London',), ('Cairo',)]

# Answer 8(c)

In [12]:
%sql SELECT * FROM Temp_table WHERE Country = 'India';

 * sqlite:///mydatabase.db
Done.

[('Mumbai', 'India', 'Winter', 24.8, 5.9),
 ('Mumbai', 'India', 'Spring', 28.4, 16.2),
 ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
 ('Mumbai', 'India', 'Fall', 27.6, 346)]

# Answer 8(d)

In [13]:
%sql SELECT * FROM Temp_table WHERE Season = 'Fall';

 * sqlite:///mydatabase.db
Done.

[('Mumbai', 'India', 'Fall', 27.6, 346),
 ('London', 'United Kingdom', 'Fall', 10.4, 218.5),
 ('Cairo', 'Egypt', 'Fall', 22.2, 4.5)]

# Answer 8(e)

In [14]:
%sql SELECT City, Country, Season FROM Temp_table GROUP BY City, Country, Season HAVING AVG(Rainfall_mm) BETWEEN 200 AND 400;

 * sqlite:///mydatabase.db
Done.

[('London', 'United Kingdom', 'Fall'),
 ('London', 'United Kingdom', 'Winter'),
 ('Mumbai', 'India', 'Fall')]

# Answer 8(f)

In [20]:
%sql SELECT City, Country FROM Temp_table WHERE Season = 'Fall' GROUP BY City, Country HAVING AVG(Temperature_C) > 20 ORDER BY AVG(Temperature_C);

 * sqlite:///mydatabase.db
Done.

[('Cairo', 'Egypt'), ('Mumbai', 'India')]

# Answer 8(g)

In [18]:
%sql SELECT City, SUM(Rainfall_mm) AS TotalRainfall FROM Temp_table WHERE City = 'Cairo' GROUP BY City;

 * sqlite:///mydatabase.db
Done.

[('Cairo', 27.6)]

# Answer 8(h)

In [21]:
%sql SELECT Season, SUM(Rainfall_mm) AS TotalRainfall FROM Temp_table GROUP BY Season;

 * sqlite:///mydatabase.db
Done.

[('Fall', 569.0),
 ('Spring', 192.29999999999998),
 ('Summer', 1706.5),
 ('Winter', 230.1)]

# Answer 9

In [8]:
words = ['The', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']

upper_words = [word.upper() for word in words]

lower_words = [word.lower() for word in words]

word_lengths = [len(word) for word in words]

word_info = [[word.upper(), word.lower(), len(word)] for word in words]

long_words = [word for word in words if len(word) >= 4]

print("a) Uppercase words:")
print(upper_words)

print("\nb) Lowercase words:")
print(lower_words)

print("\nc) List of lengths of words:")
print(word_lengths)

print("\nd) Lists containing uppercase word, lowercase word, and word length:")
print(word_info)

print("\ne) Words with 4 or more characters:")
print(long_words)

a) Uppercase words:
['THE', 'QUICK', 'BROWN', 'FOX', 'JUMPS', 'OVER', 'THE', 'LAZY', 'DOG']

b) Lowercase words:
['the', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']

c) List of lengths of words:
[3, 5, 5, 3, 5, 4, 3, 4, 3]

d) Lists containing uppercase word, lowercase word, and word length:
[['THE', 'the', 3], ['QUICK', 'quick', 5], ['BROWN', 'brown', 5], ['FOX', 'fox', 3], ['JUMPS', 'jumps', 5], ['OVER', 'over', 4], ['THE', 'the', 3], ['LAZY', 'lazy', 4], ['DOG', 'dog', 3]]

e) Words with 4 or more characters:
['quick', 'brown', 'jumps', 'over', 'lazy']